---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoElementsAddedtoNewAssembly
source: html/de811629-a395-6ed8-4bfb-a1786fd6f08c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoElementsAddedtoNewAssembly Property

No elements were added to the assembly. No assembly will be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoElementsAddedtoNewAssembly { get; }
```